//===============================================================
//PRG_Procedural Map Generation
/*

1. 맵 리스트에 미리 지정된 크기의 맵 샘플들을 만들어놓는다. 맵의 0,0 제목을 <맵넓이,맵높이,2:아래통로x인덱스,4: ,6: ,8: >
로 설정한다. 맵 리스트의 카테고리는 start/end, 함정, 이벤트, 룸, 빅룸으로 한다.
2. 맵의 순서도를 생성한다. 순서도는 시작, 룸, 빅룸, 함정, 이벤트, 끝 등이 있으며 각각 맵에 최소 몇개에서 최대 몇개 들어가는지 설정해야 한다.
3. 순서도는 시작에서 시작하며, 각각의 룸은 다음 방의 정보와 어느 위치에 붙는지 알아야 한다.
4. 맵의 시작점을 기준으로 +x, -x갯수와 +y, -y갯수를 카운트하여 시작방의 좌표를 정한다.
5.  맵의 룸에 입장하는 순간 해당 룸에 해당하는 이벤트 실행
룸을 클리어할 때 구슬 생성 - 맵의 길쪽에 가져다놓으면 길이 생성돼서 이동할 수 있게
활성화되지 않은 길은 어두운 타일로 대체

** 맵타일의 정보를 가져올 때 이동가능 정보도 가져와야 한다
**
 * ・타일
 * 빈 : {x : 0, y : 0}
 * 방 : {x : 0, y : 1}
 * 통로 : {x : 0, y : 2}
 * 천장 : {x : 0, y : 3}
 * 벽 : {x : 0, y : 4}
 * 파편 : {x : 0, y : 5}
 *
 * ・이벤트
 * 문 : {x : 1, y : 0}
 * 출구 : {x : 1, y : 1}
 *
 * ・방 이벤트
 * 몹 소환1 : {x : 2, y : 0}
 * 몹 소환2 : {x : 2, y : 1}
 * 몹 소환3 : {x : 2, y : 2}
 * 몹 소환4 : {x : 2, y : 3}
 * 몹 소환5 : {x : 2, y : 4}
 * 몹 소환6 : {x : 2, y : 5}
 * 몹 소환7 : {x : 2, y : 6}
 * 몹 소환8 : {x : 2, y : 7}
 * 몹 소환9 : {x : 2, y : 8}
 *
 * ・함정 이벤트
 * 함정1 : {x : 3, y : 0}
 * 함정2 : {x : 3, y : 1}
 * 함정3 : {x : 3, y : 2}
 * 함정4 : {x : 3, y : 3}
 * 함정5 : {x : 3, y : 4}
 *
 * ・그 외 이벤트
 * 보물상자1 : {x : 4, y : 0}
 * 보물상자2 : {x : 4, y : 1}
 * 보물상자3 : {x : 4, y : 2}
 * 보물상자4 : {x : 4, y : 3}
 * 보물상자5 : {x : 4, y : 4}
 * 퀘스트npc1 : {x : 4, y : 5}
 * 퀘스트npc2 : {x : 4, y : 6}
 * 퀘스트npc3 : {x : 4, y : 7}
 * 회복동상 : {x : 4, y : 8}
 * 상점 : {x : 4, y : 9}
*/

/*:
 * @plugindesc <PRG_Procedural Map Generation>
 * Random Map Generation
 * @version 0.01
 * 
 */
var Imported = Imported || {};
Imported.PRG_Procedural Map Generation = true;


//-----------------------------------------------------------------------------
// Game_MapGenerator
//
// 맵 생성기 (큰 방)

function Game_MapGenerator() {
    this.initialize();
}

// 오토 타일 분석 타일 id 목록
//tileIdsFloor : 바닥
//tileIdsWall : 벽
//candidate : 후보 타일 ID
//connect : 연결 타일 ID
//noConnect : 비 연결 타일 ID
Game_MapGenerator.tileIdsFloor = {};

Game_MapGenerator.tileIdsFloor.candidate =
    [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11,
        12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23,
        24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35,
        36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47];

Game_MapGenerator.tileIdsFloor.connect = {
    1: [0, 1, 2, 3, 4, 5, 6, 7, 16, 17, 18, 19,
        20, 21, 24, 26, 28, 29, 30, 31, 32, 33, 34, 35,
        36, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47],         // 1:왼쪽
    2: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11,
        12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23,
        24, 25, 26, 27, 32, 34, 35, 36, 37, 42, 47],         // 2:아래
    3: [0, 1, 2, 3, 8, 9, 10, 11, 16, 17, 20, 22,
        24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 36,
        37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47],         // 3:오른쪽
    4: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11,
        12, 13, 14, 15, 20, 21, 22, 23, 24, 25, 26, 27,
        28, 29, 30, 31, 33, 36, 37, 38, 39, 45, 47],         // 4:왼쪽
    6: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11,
        12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23,
        28, 29, 30, 31, 33, 34, 35, 40, 41, 43, 47],         // 6:오른쪽
    7: [0, 2, 4, 6, 8, 10, 12, 14, 16, 17, 18, 19,
        20, 21, 22, 23, 24, 25, 28, 30, 32, 33, 34, 35,
        36, 37, 38, 40, 41, 42, 43, 44, 45, 46, 47],         // 7:왼쪽 위
    8: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11,
        12, 13, 14, 15, 16, 17, 18, 19, 24, 25, 26, 27,
        28, 29, 30, 31, 32, 38, 39, 40, 41, 44, 47],         // 8:위
    9: [0, 1, 4, 5, 8, 9, 12, 13, 16, 18, 20, 21,
        22, 23, 24, 25, 26, 27, 28, 29, 32, 33, 34, 35,
        36, 37, 38, 39, 40, 42, 43, 44, 45, 46, 47]          // 9:오른쪽 위
};

Game_MapGenerator.tileIdsFloor.noConnect = {
    1: [8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19,
        22, 23, 25, 27, 28, 29, 30, 31, 32, 33, 34, 35,
        37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47],         // 1:左下
    2: [28, 29, 30, 31, 33, 38, 39, 40, 41, 43, 44, 45, 46], // 2:下
    3: [4, 5, 6, 7, 12, 13, 14, 15, 18, 19, 21, 23,
        24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 35, 36,
        37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47],         // 3:右下
    4: [16, 17, 18, 19, 32, 34, 35, 40, 41, 42, 43, 44, 46], // 4:左
    6: [24, 25, 26, 27, 32, 36, 37, 38, 39, 42, 44, 45, 46], // 6:右
    7: [1, 3, 5, 7, 9, 11, 13, 15, 16, 17, 18, 19,
        20, 21, 22, 23, 26, 27, 29, 31, 32, 33, 34, 35,
        36, 37, 39, 40, 41, 42, 43, 44, 45, 46, 47],         // 7:左上
    8: [20, 21, 22, 23, 33, 34, 35, 36, 37, 42, 43, 45, 46], // 8:上
    9: [2, 3, 6, 7, 10, 11, 14, 15, 17, 19, 20, 21,
        22, 23, 24, 25, 26, 27, 30, 31, 32, 33, 34, 35,
        36, 37, 38, 39, 41, 42, 43, 44, 45, 46, 47]          // 9:右上
};

Game_MapGenerator.tileIdsWall = {};

Game_MapGenerator.tileIdsWall.candidate =
    [0, 1, 2, 3, 4, 5, 6, 7,
        8, 9, 10, 11, 12, 13, 14, 15];

Game_MapGenerator.tileIdsWall.connect = {
    2: [0, 1, 2, 3, 4, 5, 6, 7],  // 2:下
    4: [0, 2, 4, 6, 8, 10, 12, 14],  // 4:左
    6: [0, 1, 2, 3, 8, 9, 10, 11],  // 6:右
    8: [0, 1, 4, 5, 8, 9, 12, 13]   // 8:上
};

Game_MapGenerator.tileIdsWall.noConnect = {
    2: [8, 9, 10, 11, 12, 13, 14, 15],  // 2:下
    4: [1, 3, 5, 7, 9, 11, 13, 15],  // 4:左
    6: [4, 5, 6, 7, 12, 13, 14, 15],  // 6:右
    8: [2, 3, 6, 7, 10, 11, 14, 15]   // 8:上
};
(function () {

})();